React Integration API/app/controllers/api/v1/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "address", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Belgrano"], ["address", "Spain"], ["user_id", 1], ["created_at", "2022-02-05 14:57:31.322477"], ["updated_at", "2022-02-05 14:57:31.322477"]]
---
    def create
        @restaurant = Restaurant.new(restaurant_params)
        @restaurant.user = current_user
        authorize @restaurant
        if @restaurant.save

UPDATE "restaurants" SET "name" = ?, "address" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["name", "Pizzeria"], ["address", "Palermo"], ["updated_at", "2022-02-08 23:40:05.638172"], ["id", 3]]
---
    def update
        if @restaurant.update(restaurant_params)

DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 2]]
---
    def destroy
        @restaurant.destroy